<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom">
  <title>桥头打字员</title>
  
  
  <link href="http://example.com/atom.xml" rel="self"/>
  
  <link href="http://example.com/"/>
  <updated>2024-02-08T04:29:23.078Z</updated>
  <id>http://example.com/</id>
  
  <author>
    <name>Henry</name>
    
  </author>
  
  <generator uri="https://hexo.io/">Hexo</generator>
  
  <entry>
    <title>HCSA</title>
    <link href="http://example.com/2024/01/21/HCSA/"/>
    <id>http://example.com/2024/01/21/HCSA/</id>
    <published>2024-01-21T15:26:14.000Z</published>
    <updated>2024-02-08T04:29:23.078Z</updated>
    

    <content type="html"><![CDATA[<h2 id="C-C-内存分区模型"><a href="#C-C-内存分区模型" class="headerlink" title="C/C++内存分区模型"></a>C/C++内存分区模型</h2><p>C/C++程序在执行时，将内存大方向划分为<strong>4个区域</strong></p><ul><li>代码区：存放函数体的二进制代码，由操作系统进行管理,只读</li><li>全局区：存放<code>全局变量和静态变量以及常量</code>，可读可写</li><li>堆区：由程序员分配和释放,若程序员不释放,程序结束时由操作系统回收,可读可写</li><li>栈区：由编译器自动分配释放, 存放<code>函数的参数值,局部变量</code>等，可读可写</li></ul><p><strong>内存四区意义：</strong></p><p>不同区域存放的数据，赋予不同的生命周期, 给我们更大的灵活编程</p><p><strong>程序编译后</strong>，win下生成exe可执行程序，Linux下生成ELF格式可执行文件，<strong>未执行该程序前</strong>分为两个区域</p><p>​    <strong>代码区：</strong></p><p>​        存放 CPU 执行的机器指令</p><p>​        代码区是<strong>共享</strong>的，共享的目的是对于频繁被执行的程序，只需要在内存中有一份代码即可</p><p>​        代码区是<strong>只读</strong>的，使其只读的原因是防止程序意外地修改了它的指令</p><p>​    <strong>全局区：</strong><br>​    由数据区data+未初始化区bss+常量区组成</p><ul><li>data区：存放的是已经初始化的全局变量、静态变量</li><li>bss区：存放未初始化的全局变量和未初始化的静态变量，由exec初始化为0</li><li>常量区：存放字符串常量和const修饰的全局变量，只读</li></ul><p>可执行程序的三段是指【text段、data段、bss段】</p><p><img src="/2021/05/21/%E9%9D%A2%E5%90%91%E5%AF%B9%E8%B1%A1/bss.png" alt="bss"></p><p><img src="/2021/05/21/%E9%9D%A2%E5%90%91%E5%AF%B9%E8%B1%A1/4%E5%8C%BA.png" alt="4"></p><h2 id="堆和栈的区别"><a href="#堆和栈的区别" class="headerlink" title="堆和栈的区别"></a>堆和栈的区别</h2><p>栈是由编译器在程序运行时分配的空间，由操作系统维护.堆是由malloc()函数分配的内存块，内存的管理由程序员手动控制，在C语言使用free()函数完成.主要区别有一下几点：</p><ul><li>管理方式不同<br>程序在运行时栈由操作系统自动管理，无须程序员手工控制；而堆空间的申请、释放工作由程序员控制，容易产生内存泄露.</li><li>空间大小不同</li></ul><p><strong>栈是向低地址扩展</strong>，是一块连续的内存区域.即栈顶的地址和栈的最大容量是系统预先规定好的，当申请的空间超过栈的剩余空间时，将出现栈溢出错误。<strong>堆是向高地址扩展</strong>，是不连续的内存区域.因为系统是用==链表==来存储空闲内存地址的，且链表的遍历方向是由低地址高地址.</p><ul><li>产生碎片不同<br>对于堆来说，频繁的malloc/free势必会造成内存空间的不连续从而造成大量的碎片，使程序效率降低.对于栈来说，一定是连续的物理内存空间。它是有点类似于数据结构上的一个先进后出的栈，进出一一对应，不会产生碎片。</li><li>增长方式不同<br>在X86平台上，堆的增长方向是向上，即向着内存地址增加的方向；栈的增长方向是向下的，即向着内存地址减小的方向.</li><li>分配方式不同<br>堆都是程序中由malloc()函数动态申请分配并由free() 函数释放；栈的分配和释放是由操作系统完成的，栈的动态分配有alloca()函数完成，但是栈的动态分配和堆是不同的，其由编译器进行分配和释放，无须手工完成.</li><li>分配效率不同<br>栈是系统提供的，操作系统会在底层对栈提供支持：分配专门的寄存器存放栈的地址，压栈出栈都是专门的指令执行。堆则是C 函数库提供的，它的机制很复杂，例如为了分配一块内存，则需要操作系统重新整理内存，搜索整理内存空间，这样就有机会分到足够大小的内存，然后返回。显然，堆的效率比栈要低的多.</li></ul><h2 id="static-关键字"><a href="#static-关键字" class="headerlink" title="static 关键字"></a>static 关键字</h2><ul><li>用于修饰局部变量，使其具有静态存储期，即在函数调用结束后不会被销毁，而是保留上一次的值。这样可以实现一些特殊的功能，比如计数器，累加器等。</li><li>用于修饰全局变量或函数，使其具有文件作用域，即只能在定义它的源文件中被访问，而不能被其他文件访问。这样可以避免命名冲突，提高程序的模块化和封装性。</li><li>用于修饰类的数据成员或成员函数，使其属于整个类，而不是某个对象。这样可以实现类的共享数据和函数，节省内存空间，提高效率。</li></ul><h2 id="指针-数组-函数"><a href="#指针-数组-函数" class="headerlink" title="指针 数组 函数"></a>指针 数组 函数</h2><figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">int</span> *p[<span class="number">10</span>]    <span class="comment">//指针数组</span></span><br><span class="line"><span class="built_in"><span class="keyword">int</span></span> (*p)[<span class="number">10</span>]  <span class="comment">//数组指针</span></span><br><span class="line"><span class="function"><span class="keyword">int</span> *<span class="title">p</span><span class="params">(<span class="keyword">int</span>)</span>   <span class="comment">//函数声明</span></span></span><br><span class="line"><span class="function"><span class="title">int</span> <span class="params">(*p)</span><span class="params">(<span class="keyword">int</span>)</span> <span class="comment">//函数指针</span></span></span><br><span class="line"><span class="function">    </span></span><br><span class="line"><span class="function"><span class="keyword">int</span> <span class="title">Func</span><span class="params">(<span class="keyword">int</span> x)</span></span>;   <span class="comment">/*声明一个函数*/</span></span><br><span class="line"><span class="built_in"><span class="keyword">int</span></span> (*p) (<span class="keyword">int</span> x);  <span class="comment">/*定义一个函数指针*/</span></span><br><span class="line">p = Func;          <span class="comment">/*将Func函数的首地址赋给指针变量p*/</span></span><br></pre></td></tr></table></figure><ul><li>int *p[10]表示指针数组，强调数组概念，是一个数组变量，数组大小为10，数组内每个元素都是指向int类型的指针变量。</li><li>int (*p)[10]表示数组指针，强调是指针，只有一个变量，是指针类型，不过指向的是一个int类型的数组，这个数组大小是10。</li><li>int *p(int)是函数声明，函数名是p，参数是int类型的，返回值是int *类型的。</li><li>int (*p)(int)是函数指针，强调是指针，该指针指向的函数具有int类型参数，并且返回值是int类型的。</li><li>如果在程序中定义了一个函数，那么在编译时系统就会为这个函数代码分配一段存储空间，这段存储空间的首地址称为这个函数的地址。而且函数名表示的就是这个地址。既然是地址我们就可以定义一个指针变量来存放，这个指针变量就叫作函数指针变量，简称函数指针。</li><li>最后需要注意的是，指向函数的指针变量没有 ++ 和 – 运算。</li></ul><h2 id="new-delete-与-malloc-free"><a href="#new-delete-与-malloc-free" class="headerlink" title="new/delete 与 malloc/free"></a>new/delete 与 malloc/free</h2><p><strong>相同点</strong></p><ul><li>都可用于内存的动态申请和释放</li></ul><p><strong>不同点</strong></p><ul><li>前者是C++运算符，支持重载overload，后者是C/C++语言标准库函数，支持覆盖override</li><li>new自动计算要分配的空间大小，malloc需要手工计算</li><li>new是封装了malloc，直接free不会报错，但是这只是释放内存，而不会析构对象</li><li>new是类型安全的，malloc不是。因为 new 内置了<strong>sizeof、类型转换和类型安全检查功能</strong>。对于<strong>非内部数据类型的对象而言，new 在创建动态对象的同时完成了初始化工作</strong>：</li></ul><figure class="highlight c"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">int</span> *p = <span class="keyword">new</span> <span class="keyword">float</span>[<span class="number">2</span>]; <span class="comment">//编译错误</span></span><br><span class="line"><span class="keyword">int</span> *p = (<span class="keyword">int</span>*)<span class="built_in">malloc</span>(<span class="number">2</span> * <span class="keyword">sizeof</span>(<span class="keyword">double</span>));<span class="comment">//编译无错误</span></span><br><span class="line"><span class="comment">//函数malloc 的原型</span></span><br><span class="line"><span class="function"><span class="keyword">void</span> * <span class="title">malloc</span><span class="params">(<span class="keyword">size_t</span> size)</span></span>;</span><br><span class="line"><span class="comment">//用 malloc 申请一块长度为length 的整数类型的内存</span></span><br><span class="line"><span class="keyword">int</span> *p = (<span class="keyword">int</span> *) <span class="built_in">malloc</span>(length * <span class="keyword">sizeof</span>(<span class="keyword">int</span>));</span><br><span class="line"><span class="comment">//函数free 的原型</span></span><br><span class="line"><span class="function"><span class="keyword">void</span> <span class="title">free</span><span class="params">( <span class="keyword">void</span> * memblock )</span></span>;</span><br><span class="line"><span class="comment">//new 创建对象数组，那么只能使用对象的无参数构造函数</span></span><br><span class="line">Obj *objects = <span class="keyword">new</span> Obj[<span class="number">100</span>];       <span class="comment">// 创建100 个动态对象</span></span><br><span class="line">Obj *objects = <span class="keyword">new</span> Obj[<span class="number">100</span>](<span class="number">1</span>);    <span class="comment">// 创建100 个动态对象的同时赋初值1  错误❌</span></span><br><span class="line"><span class="keyword">delete</span> []objects; <span class="comment">// 正确的用法</span></span><br><span class="line"><span class="keyword">delete</span> objects;   <span class="comment">// 错误的用法</span></span><br></pre></td></tr></table></figure><ul><li>new由两步构成：operator new 和 construct，operator new 对应于malloc，但 operator new可以重载，可以自定义内存分配策略；delete由deconstruct 和 operator new 构成，先析构对象，再释放内存。</li><li>malloc仅仅分配内存空间，free仅仅回收空间，不具备调用构造函数和析构函数功能，用malloc分配空间存储类的对象存在风险；new和delete除了分配回收功能外，还会调用构造函数和析构函数。</li></ul><ul><li>delete和delete[]区别：delete只会调用一次析构函数，delete[]会调用数组中每个元素的析构函数。</li></ul><h2 id="public，protected，private"><a href="#public，protected，private" class="headerlink" title="public，protected，private"></a>public，protected，private</h2><p>（1）三种访问权限</p><ul><li>public:用该关键字修饰变量和函数在类的内部外部都可以访问</li><li>private:用该关键字修饰的元素只能在类内访问</li><li>protected:用该关键字修饰的变量和函数只能在类的内部和其派生类中访问</li></ul><p>（2）三种继承方式</p><ul><li>若继承方式是public，基类成员在派生类中的访问权限保持不变</li><li>若继承方式是private，基类所有成员在派生类中的访问权限都会变为私有(private)权限；</li><li>若继承方式是protected，基类的公有成员和保护成员在派生类中的访问权限都会变为保护(protected)权限，私有成员在派生类中的访问权限仍然是私有(private)权限。</li></ul><h2 id="菱形继承"><a href="#菱形继承" class="headerlink" title="菱形继承"></a>菱形继承</h2><figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br></pre></td><td class="code"><pre><span class="line">/* class B      size(4):</span><br><span class="line">    +---</span><br><span class="line"> 4  / _b</span><br><span class="line">    +---</span><br><span class="line">*/</span><br><span class="line"></span><br><span class="line">/* class C1        size(24):</span><br><span class="line">    +---</span><br><span class="line"> 8  | &#123;vbptr&#125;</span><br><span class="line"> 8  | c1</span><br><span class="line">    +---</span><br><span class="line">    +--- (virtual base B)</span><br><span class="line"> 4  | _b</span><br><span class="line">    +---</span><br><span class="line">*/</span><br><span class="line"></span><br><span class="line">/* class C2        size(16):</span><br><span class="line">    +---</span><br><span class="line"> 8  | &#123;vbptr&#125;</span><br><span class="line"> 4  | c1</span><br><span class="line">    +---</span><br><span class="line">    +--- (virtual base B)</span><br><span class="line"> 4  | _b</span><br><span class="line">    +---</span><br><span class="line">*/</span><br><span class="line"></span><br><span class="line">/* class d      size(48):</span><br><span class="line">        +---</span><br><span class="line">   | +--- (base class C1) 16</span><br><span class="line"> 8  | | &#123;vbptr&#125;</span><br><span class="line"> 8  | | c1</span><br><span class="line">    | +---</span><br><span class="line">    | +--- (base class C2) 16</span><br><span class="line"> 8  | | &#123;vbptr&#125;</span><br><span class="line"> 4  | | c2</span><br><span class="line">    | +---  8</span><br><span class="line"> 4  | _d</span><br><span class="line">    +---</span><br><span class="line">    +--- (virtual base B)  8</span><br><span class="line"> 4  | _b</span><br><span class="line">    +---</span><br><span class="line">*/</span><br></pre></td></tr></table></figure><p>内存模型如上 64位操作系统 注意<code>字节对齐</code></p><figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span 