<!DOCTYPE html><html lang="zh-CN" data-theme="light"><head><meta charset="UTF-8"><meta http-equiv="X-UA-Compatible" content="IE=edge"><meta name="viewport" content="width=device-width,initial-scale=1"><title>面向对象 | 桥头打字员</title><meta name="keywords" content="C++,操作系统"><meta name="author" content="Henry"><meta name="copyright" content="Henry"><meta name="format-detection" content="telephone=no"><meta name="theme-color" content="#ffffff"><meta name="description" content="持续整理记录面试中C++相关问题">
<meta property="og:type" content="article">
<meta property="og:title" content="面向对象">
<meta property="og:url" content="http://example.com/2021/05/21/%E9%9D%A2%E5%90%91%E5%AF%B9%E8%B1%A1/index.html">
<meta property="og:site_name" content="桥头打字员">
<meta property="og:description" content="持续整理记录面试中C++相关问题">
<meta property="og:locale" content="zh_CN">
<meta property="og:image" content="https://pic.imgdb.cn/item/60ead34a5132923bf8e4a1b8.jpg">
<meta property="article:published_time" content="2021-05-21T14:32:12.000Z">
<meta property="article:modified_time" content="2024-01-15T01:51:07.177Z">
<meta property="article:author" content="Henry">
<meta property="article:tag" content="C++">
<meta property="article:tag" content="操作系统">
<meta name="twitter:card" content="summary">

<figure class="highlight c"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">int</span> *p = <span class="keyword">new</span> <span class="keyword">float</span>[<span class="number">2</span>]; <span class="comment">//编译错误</span></span><br><span class="line"><span class="keyword">int</span> *p = (<span class="keyword">int</span>*)<span class="built_in">malloc</span>(<span class="number">2</span> * <span class="keyword">sizeof</span>(<span class="keyword">double</span>));<span class="comment">//编译无错误</span></span><br><span class="line"><span class="comment">//函数malloc 的原型</span></span><br><span class="line"><span class="function"><span class="keyword">void</span> * <span class="title">malloc</span><span class="params">(<span class="keyword">size_t</span> size)</span></span>;</span><br><span class="line"><span class="comment">//用 malloc 申请一块长度为length 的整数类型的内存</span></span><br><span class="line"><span class="keyword">int</span> *p = (<span class="keyword">int</span> *) <span class="built_in">malloc</span>(length * <span class="keyword">sizeof</span>(<span class="keyword">int</span>));</span><br><span class="line"><span class="comment">//函数free 的原型</span></span><br><span class="line"><span class="function"><span class="keyword">void</span> <span class="title">free</span><span class="params">( <span class="keyword">void</span> * memblock )</span></span>;</span><br><span class="line"><span class="comment">//new 创建对象数组，那么只能使用对象的无参数构造函数</span></span><br><span class="line">Obj *objects = <span class="keyword">new</span> Obj[<span class="number">100</span>];       <span class="comment">// 创建100 个动态对象</span></span><br><span class="line">Obj *objects = <span class="keyword">new</span> Obj[<span class="number">100</span>](<span class="number">1</span>);    <span class="comment">// 创建100 个动态对象的同时赋初值1  错误❌</span></span><br><span class="line"><span class="keyword">delete</span> []objects; <span class="comment">// 正确的用法</span></span><br><span class="line"><span class="keyword">delete</span> objects;   <span class="comment">// 错误的用法</span></span><br></pre></td></tr></table></figure>

<ul>
<li>new由两步构成：operator new 和 construct，operator new 对应于malloc，但 operator new可以重载，可以自定义内存分配策略；delete由deconstruct 和 operator new 构成，先析构对象，再释放内存。</li>
<li>malloc仅仅分配内存空间，free仅仅回收空间，不具备调用构造函数和析构函数功能，用malloc分配空间存储类的对象存在风险；new和delete除了分配回收功能外，还会调用构造函数和析构函数。</li>
</ul>
<ul>
<li>delete和delete[]区别：delete只会调用一次析构函数，delete[]会调用数组中每个元素的析构函数。</li>
</ul>
<h2 id="public，protected，private"><a href="#public，protected，private" class="headerlink" title="public，protected，private"></a>public，protected，private</h2><p>（1）三种访问权限</p>
<ul>
<li>public:用该关键字修饰变量和函数在类的内部外部都可以访问</li>
<li>private:用该关键字修饰的元素只能在类内访问</li>
<li>protected:用该关键字修饰的变量和函数只能在类的内部和其派生类中访问</li>
</ul>
<p>（2）三种继承方式</p>
<ul>
<li>若继承方式是public，基类成员在派生类中的访问权限保持不变</li>
<li>若继承方式是private，基类所有成员在派生类中的访问权限都会变为私有(private)权限；</li>
<li>若继承方式是protected，基类的公有成员和保护成员在派生类中的访问权限都会变为保护(protected)权限，私有成员在派生类中的访问权限仍然是私有(private)权限。</li>
</ul>
<h2 id="菱形继承"><a href="#菱形继承" class="headerlink" title="菱形继承"></a>菱形继承</h2><figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br></pre></td><td class="code"><pre><span class="line">/* class B      size(4):</span><br><span class="line">    +---</span><br><span class="line"> 4  / _b</span><br><span class="line">    +---</span><br><span class="line">*/</span><br><span class="line"></span><br><span class="line">/* class C1        size(24):</span><br><span class="line">    +---</span><br><span class="line"> 8  | &#123;vbptr&#125;</span><br><span class="line"> 8  | c1</span><br><span class="line">    +---</span><br><span class="line">    +--- (virtual base B)</span><br><span class="line"> 4  | _b</span><br><span class="line">    +---</span><br><span class="line">*/</span><br><span class="line"></span><br><span class="line">/* class C2        size(16):</span><br><span class="line">    +---</span><br><span class="line"> 8  | &#123;vbptr&#125;</span><br><span class="line"> 4  | c1</span><br><span class="line">    +---</span><br><span class="line">    +--- (virtual base B)</span><br><span class="line"> 4  | _b</span><br><span class="line">    +---</span><br><span class="line">*/</span><br><span class="line"></span><br><span class="line">/* class d      size(48):</span><br><span class="line">        +---</span><br><span class="line">   | +--- (base class C1) 16</span><br><span class="line"> 8  | | &#123;vbptr&#125;</span><br><span class="line"> 8  | | c1</span><br><span class="line">    | +---</span><br><span class="line">    | +--- (base class C2) 16</span><br><span class="line"> 8  | | &#123;vbptr&#125;</span><br><span class="line"> 4  | | c2</span><br><span class="line">    | +---  8</span><br><span class="line"> 4  | _d</span><br><span class="line">    +---</span><br><span class="line">    +--- (virtual base B)  8</span><br><span class="line"> 4  | _b</span><br><span class="line">    +---</span><br><span class="line">*/</span><br></pre></td></tr></table></figure>

<p>内存模型如上 64位操作系统 注意<code>字节对齐</code></p>
